project-chip/connectedhomeip/examples/bridge-app/esp32/main/main.cpp
const EmberAfDeviceType gRootDeviceTypes[]          = { { DEVICE_TYPE_ROOT_NODE, DEVICE_VERSION_DEFAULT } };
const EmberAfDeviceType gAggregateNodeDeviceTypes[] = { { DEVICE_TYPE_BRIDGE, DEVICE_VERSION_DEFAULT } };

const EmberAfDeviceType gBridgedOnOffDeviceTypes[] = { { DEVICE_TYPE_LO_ON_OFF_LIGHT, DEVICE_VERSION_DEFAULT },
                                                       { DEVICE_TYPE_BRIDGED_NODE, DEVICE_VERSION_DEFAULT } };

#if CONFIG_ENABLE_CHIP_SHELL
using chip::Shell::Engine;
using chip::Shell::shell_command_t;

Engine sShellBridgeSubCommands;

// Find device index by endpoint ID
static int FindDeviceByEndpoint(EndpointId endpointId)
{
    for (size_t i = 0; i < kMaxBridgedDevices; i++)
    {
        if (gBridgedDevices[i] != nullptr && gBridgedDevices[i]->GetEndpointId() == endpointId)
        {
            return static_cast<int>(i);
        }
    }
    return -1;
}

static CHIP_ERROR BridgeHelpHandler(int argc, char ** argv)
{
    sShellBridgeSubCommands.ForEachCommand(chip::Shell::PrintCommandHelp, nullptr);
    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeAddHandler(int argc, char ** argv)
{
    if (argc > 2)
    {
        ESP_LOGE(TAG, "Usage: bridge add [name] [location]");
        ESP_LOGE(TAG, "  name: optional device name (default: 'Light <N>')");
        ESP_LOGE(TAG, "  location: optional location (default: 'Room')");
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    // Check if we have room for more devices
    if (gBridgedDeviceCount >= kMaxBridgedDevices)
    {
        ESP_LOGE(TAG, "Max bridged devices reached (%zu). Cannot add more.", kMaxBridgedDevices);
        return CHIP_ERROR_NO_MEMORY;
    }

    // Create device name - use device count + 1 for default naming
    char defaultName[32];
    const char * name;
    if (argc >= 1)
    {
        name = argv[0];
    }
    else
    {
        snprintf(defaultName, sizeof(defaultName), "Light %zu", gBridgedDeviceCount + 1);
        name = defaultName;
    }

    const char * location = (argc >= 2) ? argv[1] : "Room";

    // Allocate new device and data versions
    Device * newDevice = new Device(name, location);
    if (newDevice == nullptr)
    {
        ESP_LOGE(TAG, "Failed to allocate memory for new device");
        return CHIP_ERROR_NO_MEMORY;
    }

    DataVersion * newDataVersions = new DataVersion[MATTER_ARRAY_SIZE(bridgedLightClusters)];
    if (newDataVersions == nullptr)
    {
        delete newDevice;
        ESP_LOGE(TAG, "Failed to allocate memory for data versions");
        return CHIP_ERROR_NO_MEMORY;
    }
    memset(newDataVersions, 0, sizeof(DataVersion) * MATTER_ARRAY_SIZE(bridgedLightClusters));

    // Set device as reachable and configure callback
    newDevice->SetReachable(true);
    newDevice->SetChangeCallback(&HandleDeviceStatusChanged);

    // Try to add the device endpoint
    int result = AddDeviceEndpoint(newDevice, &bridgedLightEndpoint, Span<const EmberAfDeviceType>(gBridgedOnOffDeviceTypes),
                                   Span<DataVersion>(newDataVersions, MATTER_ARRAY_SIZE(bridgedLightClusters)), 1);
    if (result < 0)
    {
        delete newDevice;
        delete[] newDataVersions;
        ESP_LOGE(TAG, "Failed to add device endpoint - no available endpoints");
        return CHIP_ERROR_ENDPOINT_POOL_FULL;
    }

    // Find first empty slot in our tracking array
    bool slotFound = false;
    for (size_t i = 0; i < kMaxBridgedDevices; i++)
    {
        if (gBridgedDevices[i] == nullptr)
        {
            gBridgedDevices[i]      = newDevice;
            gBridgedDataVersions[i] = newDataVersions;
            gBridgedDeviceCount++;
            slotFound = true;
            break;
        }
    }

    if (!slotFound)
    {
        // This shouldn't happen if gBridgedDeviceCount is accurate, but handle it gracefully
        ESP_LOGE(TAG, "Internal error: no slot found despite count check. Cleaning up.");
        RemoveDeviceEndpoint(newDevice);
        delete newDevice;
        delete[] newDataVersions;
        return CHIP_ERROR_INTERNAL;
    }

    ESP_LOGI(TAG, "Added '%s' @ %s (endpoint %d) [%zu/%zu]", name, location, newDevice->GetEndpointId(), gBridgedDeviceCount,
             kMaxBridgedDevices);

    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeRemoveHandler(int argc, char ** argv)
{
    if (argc != 1)
    {
        ESP_LOGE(TAG, "Usage: bridge remove <endpoint>");
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    char * end;
    long endpointId = strtol(argv[0], &end, 10);
    if (end == argv[0] || *end != '\0' || endpointId < 0 || endpointId > 0xFFFF)
    {
        ESP_LOGE(TAG, "Invalid endpoint ID: %s (must be 0-65535)", argv[0]);
        return CHIP_ERROR_INVALID_ARGUMENT;
    }

    int idx = FindDeviceByEndpoint(static_cast<EndpointId>(endpointId));
    if (idx < 0)
    {
        ESP_LOGE(TAG, "No device at endpoint %ld", endpointId);
        return CHIP_ERROR_NOT_FOUND;
    }

    const char * name = gBridgedDevices[idx]->GetName();
    CHIP_ERROR err    = RemoveDeviceEndpoint(gBridgedDevices[idx]);
    if (err == CHIP_NO_ERROR)
    {
        ESP_LOGI(TAG, "Removed '%s' from endpoint %ld", name, endpointId);
        delete gBridgedDevices[idx];
        delete[] gBridgedDataVersions[idx];
        gBridgedDevices[idx]      = nullptr;
        gBridgedDataVersions[idx] = nullptr;
        gBridgedDeviceCount--;
    }
    else
    {
        ESP_LOGE(TAG, "Failed to remove '%s'", name);
        return err;
    }

    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeListHandler(int argc, char ** argv)
{
    ESP_LOGI(TAG, "Bridged devices (%zu/%zu):", gBridgedDeviceCount, kMaxBridgedDevices);

    if (gBridgedDeviceCount == 0)
    {
        ESP_LOGI(TAG, "  (none)");
    }
    else
    {
        for (size_t i = 0; i < kMaxBridgedDevices; i++)
        {
            if (gBridgedDevices[i] != nullptr)
            {
                ESP_LOGI(TAG, "  \"%s\" @ %s (endpoint %d, %s)", gBridgedDevices[i]->GetName(), gBridgedDevices[i]->GetLocation(),
                         gBridgedDevices[i]->GetEndpointId(), gBridgedDevices[i]->IsOn() ? "ON" : "OFF");
            }
        }
    }

