project-chip/connectedhomeip/examples/bridge-app/esp32/main/main.cpp
    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeToggleHandler(int argc, char ** argv)
{
    if (argc == 1)
    {
        // Toggle specific device by endpoint: bridge toggle <endpoint>
        char * end;
        long endpointId = strtol(argv[0], &end, 10);
        if (end == argv[0] || *end != '\0' || endpointId < 0 || endpointId > 0xFFFF)
        {
            ESP_LOGE(TAG, "Invalid endpoint ID: %s (must be 0-65535)", argv[0]);
            return CHIP_ERROR_INVALID_ARGUMENT;
        }

        int idx = FindDeviceByEndpoint(static_cast<EndpointId>(endpointId));
        if (idx < 0)
        {
            ESP_LOGE(TAG, "No device at endpoint %ld", endpointId);
            return CHIP_ERROR_NOT_FOUND;
        }

        gBridgedDevices[idx]->SetOnOff(!gBridgedDevices[idx]->IsOn());
        ESP_LOGI(TAG, "Toggled '%s' (endpoint %ld): now %s", gBridgedDevices[idx]->GetName(), endpointId,
                 gBridgedDevices[idx]->IsOn() ? "ON" : "OFF");
    }
    else
    {
        // Toggle all devices
        ESP_LOGI(TAG, "Toggling all devices:");
        for (size_t i = 0; i < kMaxBridgedDevices; i++)
        {
            if (gBridgedDevices[i] != nullptr)
            {
                gBridgedDevices[i]->SetOnOff(!gBridgedDevices[i]->IsOn());
                ESP_LOGI(TAG, "  '%s': now %s", gBridgedDevices[i]->GetName(), gBridgedDevices[i]->IsOn() ? "ON" : "OFF");
            }
        }
    }

    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeMaxHandler(int argc, char ** argv)
{
    ESP_LOGI(TAG, "Bridge endpoint limits:");
    ESP_LOGI(TAG, "  Max bridged devices: %zu", kMaxBridgedDevices);
    ESP_LOGI(TAG, "  Current devices: %zu", gBridgedDeviceCount);
    ESP_LOGI(TAG, "  Available slots: %zu", kMaxBridgedDevices - gBridgedDeviceCount);

    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeRemoveAllHandler(int argc, char ** argv)
{
    ESP_LOGI(TAG, "Removing all bridged devices...");
    int removedCount = 0;

    for (size_t i = 0; i < kMaxBridgedDevices; i++)
    {
        if (gBridgedDevices[i] != nullptr)
        {
            const char * name = gBridgedDevices[i]->GetName();
            CHIP_ERROR err    = RemoveDeviceEndpoint(gBridgedDevices[i]);
            if (err == CHIP_NO_ERROR)
            {
                ESP_LOGI(TAG, "  Removed '%s'", name);
                delete gBridgedDevices[i];
                delete[] gBridgedDataVersions[i];
                gBridgedDevices[i]      = nullptr;
                gBridgedDataVersions[i] = nullptr;
                removedCount++;
            }
            else
            {
                ESP_LOGE(TAG, "  Failed to remove '%s'", name);
            }
        }
    }
    gBridgedDeviceCount = gBridgedDeviceCount - removedCount;

    ESP_LOGI(TAG, "Removed %d devices total", removedCount);
    return CHIP_NO_ERROR;
}

static CHIP_ERROR BridgeCommandHandler(int argc, char ** argv)
{
    if (argc == 0)
    {
        return BridgeHelpHandler(argc, argv);
    }
    return sShellBridgeSubCommands.ExecCommand(argc, argv);
}

static void RegisterBridgeCommands()
{
    static const shell_command_t sBridgeSubCommands[] = {
        { &BridgeHelpHandler, "help", "Usage: bridge <subcommand>" },
        { &BridgeAddHandler, "add", "Add device: bridge add [name] [location]" },
        { &BridgeRemoveHandler, "remove", "Remove device: bridge remove <endpoint>" },
        { &BridgeRemoveAllHandler, "remove_all", "Remove all bridged devices" },
        { &BridgeMaxHandler, "max", "Show max endpoint limits" },
        { &BridgeListHandler, "list", "List all bridged devices" },
        { &BridgeToggleHandler, "toggle", "Toggle: bridge toggle [endpoint] or all" },
    };

    static const shell_command_t sBridgeCommand = { &BridgeCommandHandler, "bridge",
                                                    "Bridge commands. Usage: bridge <subcommand>" };

    sShellBridgeSubCommands.RegisterCommands(sBridgeSubCommands, MATTER_ARRAY_SIZE(sBridgeSubCommands));
    Engine::Root().RegisterCommands(&sBridgeCommand, 1);
}
#endif // CONFIG_ENABLE_CHIP_SHELL

static void InitServer(intptr_t context)
{
    PrintOnboardingCodes(chip::RendezvousInformationFlags(CONFIG_RENDEZVOUS_MODE));

    Esp32AppServer::Init(); // Init ZCL Data Model and CHIP App Server AND Initialize device attestation config

    // Set starting endpoint id where dynamic endpoints will be assigned, which
    // will be the next consecutive endpoint id after the last fixed endpoint.
    gFirstDynamicEndpointId = static_cast<chip::EndpointId>(
        static_cast<int>(emberAfEndpointFromIndex(static_cast<uint16_t>(emberAfFixedEndpointCount() - 1))) + 1);
    gCurrentEndpointId = gFirstDynamicEndpointId;

    // Disable last fixed endpoint, which is used as a placeholder for all of the
    // supported clusters so that ZAP will generated the requisite code.
    emberAfEndpointEnableDisable(emberAfEndpointFromIndex(static_cast<uint16_t>(emberAfFixedEndpointCount() - 1)), false);

    // A bridge has root node device type on EP0 and aggregate node device type (bridge) at EP1
    emberAfSetDeviceTypeList(0, Span<const EmberAfDeviceType>(gRootDeviceTypes));
    emberAfSetDeviceTypeList(1, Span<const EmberAfDeviceType>(gAggregateNodeDeviceTypes));

    // Bridge starts with no bridged devices - use shell commands to add them:
    //   bridge add [name] [location]
    //   bridge remove <endpoint>
    //   bridge list
    //   bridge max
    ESP_LOGI(TAG, "Bridge ready. Use 'bridge add [name] [location]' to add devices. Max devices: %zu", kMaxBridgedDevices);
}

void emberAfActionsClusterInitCallback(EndpointId endpoint)
{
    VerifyOrReturn(endpoint == 1,
                   ChipLogError(Zcl, "Actions cluster delegate is not implemented for endpoint with id %d.", endpoint));
    VerifyOrReturn(emberAfContainsServer(endpoint, app::Clusters::Actions::Id) == true,
                   ChipLogError(Zcl, "Endpoint %d does not support Actions cluster.", endpoint));
    VerifyOrReturn(!sActionsDelegateImpl && !sActionsServer);

    sActionsDelegateImpl = std::make_unique<app::Clusters::Actions::ActionsDelegateImpl>();
    sActionsServer       = std::make_unique<app::Clusters::Actions::ActionsServer>(endpoint, *sActionsDelegateImpl.get());

    sActionsServer->Init();
}

extern "C" void app_main()
{
    // Initialize the ESP NVS layer.
    esp_err_t err = nvs_flash_init();
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "nvs_flash_init() failed: %s", esp_err_to_name(err));
        return;
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "esp_event_loop_create_default()  failed: %s", esp_err_to_name(err));
        return;
    }

